{
	"name" : "Corona Test Verify",
	"slug" : "corona-test-verify",
	"author" : "<a href='https://osowsky-webdesign.de'>Silvio Osowsky</a>",
	"author_profile" : "https://profiles.wordpress.org/s_i_l_l_e/",
	"version" : "1.3.11",
	"download_url" : "https://plugins-wordpress-osowsky-webdesign.info/corona-verify/corona-verify.zip",
	"requires" : "3.0",
	"tested" : "5.8.2",
	"requires_php" : "7.2",
	"last_updated" : "2021-12-01- 13:59:00",
	"num_ratings" : 1,
	"rating" : 100,
	"ratings" : {
          "5" : "1",
          "4" : "0",
          "3" : "0",
          "2" : "0",
          "1" : "0"
        },
	"sections" : {
		"description" : "<h4>Beschreibung</h4><p>Nach §28 gilt seit dem 24. November für alle Betriebe der so genannte 3G-Status. D. h. Mitarbeiter dürfen ihren Betrieb nur betreten, wenn diese über einen gültigen 3G-Status (geimpft, genesen oder getestet) verfügen. Auch wenn Mitarbeiter den jeweils Verantwortlichen gegenüber einen der drei Nachweise vorlegen müssen, sind Arbeitgeber gut beraten, gültige Datenschutzbestimmungen im Blick zu haben. Denn auch diese Daten unterliegen dem Datenschutz und dürfen nur insoweit erhoben und verarbeitet werden, wie dies auf Grund dieser Gesetzeslage notwendig ist.</p> <p>Genau hier setzt dieses PlugIn an. Denn es erlaubt den Arbeitgeber, Verantwortliche zu benennen, die den jeweils vorgelegten Nachweis prüfen und dem Mitarbeiter danach eine einheitliche Bescheinigung auszustellen, aus der für andere nicht mehr erkennbar ist, welcher der drei Nachweise zu einem gültigen 3G-Status für diesen Mitarbeiter geführt hat. Die Prüfergebnisse werden für jeden Mitarbeiter hier erfasst. Danach müssen Mitarbeiter ihren Status innerhalb der Gültigkeitsdauer nicht erneut belegen, sondern haben vielmehr die Möglichkeit ihren jeweiligen Status per Smartphone abzurufen.</p> <p>Wenn es im Unternehmen einen zertifizierten Tester gibt, kann dieser einen geeigneten Test durchführen und diesen papierlos im System hinterlegen. Gleichzeitig erfüllen Arbeitnehmer mit den hier erzeugten Datensätzen Ihre Dokumentationspflicht und sind so in der Lage diese zu belegen.</p> <p>Darüber hinaus erlaubt es den Mitarbeitern mit diesem Abruf auch Dritten gegenüber (z. B. andere Mitarbeiter, Kunden oder Lieferanten) ihren gültigen Status nachzuweisen. Diese Nachweis ist mit einem verschlüsselten QR-Code ausgestattet, über den Dritte dann wiederum die aktuelle Gültigkeit diese Vorlage prüfen können. Der vom QR-Code erzeugte Link ist dabei zeitlich befristet.</p> <p>Voraussetzung für die Nutzung dieses PlugIns ist, dass die Mitarbeiter als User im Dashboard angelegt sind.</p><h4>Description</h4><p>According to §28, the so-called 3G status has been in effect for all businesses since November 24th. I. E. Employees are only allowed to enter their company if they have a valid 3G status (vaccinated, recovered or tested). Even if employees have to present one of the three proofs to the responsible person, employers are well advised to keep an eye on valid data protection regulations. Because this data is also subject to data protection and may only be collected and processed to the extent that this is necessary on the basis of this legal situation.</p> <p>This is exactly where this plug-in comes in. This is because it allows the employer to name responsible persons who check the evidence submitted and then issue the employee with a uniform certificate from which it is no longer possible for others to recognize which of the three evidence has led to a valid 3G status for this employee. The test results are recorded here for each employee. After that, employees do not have to prove their status again within the period of validity, but rather have the option of calling up their respective status via smartphone.</p> <p>If there is a certified tester in the company, he can carry out a suitable test and store it in the system without paper. At the same time, employees fulfill their documentation requirements with the data records generated here and are thus able to prove them.</p> <p>In addition, this request allows employees to prove their valid status to third parties (e.g. other employees, customers or suppliers). This proof is equipped with an encrypted QR code, which third parties can then use to check the current validity of this template. The link generated by the QR code is limited in time. <p>The prerequisite for using this plug-in is that the employees are created as users in the dashboard.</p>",
		"installation" : "<h4>Add shortcode to page</h4> <pre>[corona-verify-form]</pre>",
		"works" : "",
		"changelog" : "<h4>1.3.8 - 2021-11-29</h4> <ul><li>include deInstall routine</li><li>include install routine</li></ul><h4>1.3.8 - 2021-11-29</h4> <ul><li>add plugin rating routine</li><li>FIX: plugin update routine</li> </ul><h4>1.3.7 - 2021-11-28</h4> <ul> <li>include plugin update routine</li> </ul> <h4>1.3.5 - 2021-11-28</h4> <ul> <li>now can save option params to db</li> <li>implemnts option admin view </li> </ul> <h4>1.3.0 - 2021-11-28</h4> <ul> <li>WP_LIST_TABLE Layout for employess and coronba test view implements </li> </ul> <h4>1.2.1 - 2021-11-27</h4> <ul> <li>FIX: own last test view for employee now is displayed</li> </ul> <h4>1.2.0 - 2021-11-26</h4> <ul> <li>include admin menu for tests and employees</li> <li>include admin menu for employees</li> <li>include admin menu</li> <li>include style classes</li> </ul> <h4>1.1.0 - 2021-11-25</h4> <ul> <li>include qr security</li> <li>include qr classes</li> <li>include fa css</li> <li>include style classes</li> </ul> <h4>1.0.2 - 2021-11-23</h4> <ul> <li>build db domain</li> <li>create db path/li> </ul> <h4>1.0.1 - 2021-11-22</h4> <ul> <li>build plugin struktur</li> <li>start project</li> </ul>"
	},
	"banners" : {
		"low" : "https://plugins-wordpress-osowsky-webdesign.info/corona-verify/banner-772x250.jpg",
		"high" : "hhttps://plugins-wordpress-osowsky-webdesign.info/corona-verify/banner-1544x500.jpg"
	}
}